In [6]:
import pandas as pd
import os
import sqlalchemy
import pymysql

In [7]:
os.getcwd()
os.chdir("/home/dell/Desktop")
data = pd.read_csv("/home/dell/Desktop/a.us.txt",parse_dates = ['Date'] , index_col = ['Date'])
data.head()

              Open    High     Low   Close    Volume  OpenInt
Date
1999-11-18  30.713  33.754  27.002  29.702  66277506        0
1999-11-19  28.986  29.027  26.872  27.257  16142920        0
1999-11-22  27.886  29.702  27.044  29.702   6970266        0
1999-11-23  28.688  29.446  27.002  27.002   6332082        0
1999-11-24  27.083  28.309  27.002  27.717   5132147        0

In [19]:
engine = sqlalchemy.create_engine('mysql+pymysql://root:123@localhost:3306/practice')

In [24]:
df = pd.read_sql('customer' , engine , index_col='cid')
df

     name  phno
cid
1     skl   123
2    skl1   123
3    skl2   123
4    skl3  1234
5    skl4  1234

In [25]:
data.to_sql(
    name = 'Apple',
    con = engine ,
    index = True    
)

In [27]:
data1 = pd.read_sql('Apple' , engine ,index_col='Date')
data1.head()

              Open    High     Low   Close    Volume  OpenInt
Date
1999-11-18  30.713  33.754  27.002  29.702  66277506        0
1999-11-19  28.986  29.027  26.872  27.257  16142920        0
1999-11-22  27.886  29.702  27.044  29.702   6970266        0
1999-11-23  28.688  29.446  27.002  27.002   6332082        0
1999-11-24  27.083  28.309  27.002  27.717   5132147        0

In [31]:
type(data1.index)

pandas.core.indexes.datetimes.DatetimeIndex